app/controllers/editor_controller.rb

SELECT "editors".* FROM "editors" WHERE "editors"."name" = ? LIMIT ?  [["name", "みきと"], ["LIMIT", 1]]
---
  def login
    @editor = Editor.find_by(name: params[:name])