app/controllers/home_controller.rb

SELECT "illusts".* FROM "illusts" ORDER BY "illusts"."created_at" DESC
---
  def top
    @illusts = Illust.all.order(created_at: :desc)