app/controllers/illust_controller.rb

SELECT "illusts".* FROM "illusts" ORDER BY "illusts"."created_at" DESC
---
  def index
    @illusts = Illust.all.order(created_at: :desc)

SELECT "illusts".* FROM "illusts" WHERE "illusts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @illust = Illust.find_by(id: params[:id])

SELECT "illusts".* FROM "illusts" WHERE "illusts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def showtp
    @illust = Illust.find_by(id: params[:id])

INSERT INTO "illusts" ("created_at", "updated_at", "title", "name", "model", "transparent") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2023-02-04 15:22:03.220763"], ["updated_at", "2023-02-04 15:22:03.220763"], ["title", "rth"], ["name", "erg"], ["model", "gera"], ["transparent", nil]]
---
  def create
    @illust = Illust.new(
      title: params[:title],
      name: params[:name],
      model: params[:model],
    )
    if @illust.save

SELECT "illusts".* FROM "illusts" WHERE "illusts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @illust = Illust.find_by(id: params[:id])

SELECT "illusts".* FROM "illusts" WHERE "illusts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "illusts" SET "updated_at" = ?, "transparent" = ? WHERE "illusts"."id" = ?  [["updated_at", "2023-02-04 14:17:58.968046"], ["transparent", "fulen1tp"], ["id", 5]]
---
  def update
    @illust = Illust.find_by(id: params[:id])
    @illust.title = params[:title]
    @illust.model = params[:model]

    if params[:image]
      @illust.name = params[:name]
      image = params[:image]
      File.binwrite("public/illusts/#{@illust.name}", image.read)
    end

    if params[:imagetp]
      @illust.transparent = "#{params[:name]}tp"
      image = params[:imagetp]
      File.binwrite("public/illusts/#{@illust.name}tp", image.read)
    end

    if @illust.save

SELECT "illusts".* FROM "illusts" WHERE "illusts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "illusts" WHERE "illusts"."id" = ?  [["id", 7]]
---
  def del
    @illust = Illust.find_by(id: params[:id])
    @illust.destroy