app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC
---
  def index
    @messages = Message.all.order(created_at: :desc)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @message = Message.find_by(id: params[:id])

INSERT INTO "messages" ("name", "content", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ひみつ"], ["content", "質問やリクエストなど(200文字)"], ["answer", "未回答"], ["created_at", "2023-02-03 14:39:37.044072"], ["updated_at", "2023-02-03 14:39:37.044072"]]
---
  def create
    @message = Message.new(
      name: params[:name],
      content: params[:content],
      answer: "未回答"
    )
    if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def answer
    @message = Message.find_by(id: params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "messages" SET "answer" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["answer", "akemasite"], ["updated_at", "2023-02-04 14:51:12.533286"], ["id", 8]]
---
  def update
    @message = Message.find_by(id: params[:id])
    @message.answer = params[:answer]
    if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 7]]
---
  def del
    @message = Message.find_by(id: params[:id])
    @message.destroy